[{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c4"
  },
  "name": "Ragi Finger Millet Roti",
  "title": "Ragi Millet Roti: Strengthen Bones with This Calcium-Rich Flatbread",
  "category": "breakfast",
  "date": "2025-12-17",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763510/photo-1763080348919-0a4969e31afc_ox1cis.jpg",
  "blog_likes": [
    "6970684e57f0f31edce78868"
  ],
  "quick_summary": "A traditional gluten-free flatbread crafted from ancient calcium-rich ragi flour, perfect for a slow-release energy breakfast. This rustic roti is especially beneficial for bone health and managing blood sugar levels throughout a busy morning. Pair it with a side of fresh yogurt or spicy pickle for a truly authentic and healthy experience.",
  "description": "Ragi, or finger millet, is a nutrient-dense grain that has been used for centuries for its high calcium content. This roti is made by mixing ragi flour with warm water, chopped onions, and green chilies to create a soft, pliable dough. It is cooked on a hot griddle with a touch of ghee, resulting in a nutty, wholesome bread that keeps you full for hours.",
  "health_benefits": [
    "Gluten-free",
    "High calcium",
    "",
    ""
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299ce"
  },
  "name": "Buckwheat Pancakes",
  "title": "Buckwheat: Improve Circulation with These Gluten-Free Pancakes",
  "category": "breakfast",
  "date": "2025-11-26",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763244/photo-1765192470534-85f4dd6cb4ef_d2c6zj.jpg",
  "blog_likes": [
    "6970684e57f0f31edce78868",
    "6968a51539978105ccf063a1"
  ],
  "quick_summary": "Nutty-flavored buckwheat pancakes served with a homemade sugar-free berry compote for a touch of natural sweetness. These gluten-free pancakes are rich in magnesium, which is essential for healthy blood flow and cardiovascular support. They offer a sophisticated texture and earthy taste that makes breakfast feel like a truly special occasion.",
  "description": "Despite its name, buckwheat is a gluten-free seed that creates a hearty and fiber-rich pancake batter. We combine buckwheat flour with almond milk and a touch of vanilla to create a pancake that is satisfying without the sugar crash of white flour. The berry compote is made by simmering frozen berries until they form a thick, natural syrup.",
  "health_benefits": [
    "Complete protein source",
    "Rich in plant-based protein"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299bd"
  },
  "name": "Turmeric Chickpea Stew",
  "title": "Turmeric Chickpeas: Golden Anti-Inflammatory",
  "category": "dinner",
  "date": "2026-01-20",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762467/photo-1767416901115-f80054d8d3c2_ievsd5.jpg",
  "blog_likes": [
    "6970aa307c0e4148535e2100",
    "6970684e57f0f31edce78868"
  ],
  "quick_summary": "A warm, anti-inflammatory pot of chickpeas and spinach simmered in creamy coconut milk. This comforting stew is infused with fresh ginger and golden turmeric to boost your immune system and soothe the body. It serves as a hearty, plant-based dinner that is both filling and deeply nourishing for any night of the week.",
  "description": "This stew is a staple for wellness enthusiasts, combining the healing properties of curcumin with the plant-based protein of chickpeas. We start by sautéing aromatics like onions and garlic before adding a generous amount of fresh turmeric root. The addition of full-fat coconut milk creates a silky texture that perfectly complements the earthy notes of the legumes and fresh spinach leaves.",
  "health_benefits": [
    "Reduces inflammation",
    "High in plant protein",
    "Supports gut health"
  ],
  "bookmark": [
    "695fb0ffeb4ddf4035bed9e2"
  ]
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299bf"
  },
  "name": "Baked Lemon ",
  "title": "Lemon Salmon: Support Brain Health with This Omega-Rich Dinner",
  "category": "breakfast",
  "date": "2026-01-22",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762618/photo-1766186471436-5bb49b29c1c8_jxjgts.jpg",
  "blog_likes": [],
  "quick_summary": "Oven-baked salmon fillets seasoned with fresh lemon slices, minced garlic, and cracked black pepper. This dish is specifically designed to support cognitive function through high levels of essential Omega-3 fatty acids. It is a sophisticated yet simple dinner that delivers premium lean protein necessary for muscle repair.",
  "description": "Premium Atlantic salmon is the star of this dish, prepared using a gentle baking method to preserve its delicate oils. The fillets are topped with thin lemon rounds and a house-made garlic herb butter that melts into the fish as it cooks. It is an elegant meal that pairs beautifully with roasted asparagus or a light side of wild rice.",
  "health_benefits": [
    "Omega-3 fatty acids",
    "Brain health support",
    "Heart health",
    "test"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "696639dbfd79f36934832d97"
  },
  "name": "Ginger Lentil Coconut Curry",
  "title": "Ginger Lentils: Comforting Immune Boost",
  "category": "vegan",
  "date": "2026-01-14",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1766745562/samples/coffee.jpg",
  "quick_summary": "A cozy, protein-rich lentil curry gently simmered in coconut milk and warming spices. Fresh ginger, cumin, and coriander come together to create a deeply satisfying plant-based dinner that nourishes the body and calms the mind.",
  "health_benefits": [
    "Boosts immunity",
    "Rich in plant-based protein"
  ],
  "blog_likes": [
    "696a1be2a3d538d6b8c48934"
  ],
  "description": "This comforting curry highlights the natural creaminess of red lentils paired with immune-supporting ginger and aromatic spices. We begin by blooming spices in coconut oil before adding lentils and coconut milk for a rich, velvety texture. Finished with a squeeze of lime and fresh cilantro, this dish is perfect for weeknight dinners or mindful meal prep.",
  "__v": 0,
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c1"
  },
  "name": "Blueberry Oatmeal ",
  "title": "Blueberries & Oats: Enjoy Antioxidant Energy in These Wholesome Muffins",
  "category": "breakfast",
  "date": "2026-01-01",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762881/photo-1767455674369-3fbf33d80ff8_dy4yvg.jpg",
  "blog_likes": [],
  "quick_summary": "Wholesome muffins made with fiber-rich rolled oats, probiotic Greek yogurt, and bursts of fresh blueberries. These treats offer a guilt-free way to satisfy your morning sweet tooth while providing sustained energy for your commute. They are low in refined sugar and high in antioxidants to help you start your day on a healthy note.",
  "description": "These are not your average bakery muffins; they are dense with whole grains and naturally sweetened with a touch of maple syrup and fruit. We use Greek yogurt in the batter to ensure a moist crumb without the need for excessive oil or butter. Every muffin is packed with fresh blueberries that burst during baking, releasing a delicious tartness.",
  "health_benefits": [
    "Antioxidant boost",
    "High in plant protein"
  ],
  "bookmark": [
    "696a1be2a3d538d6b8c48934"
  ]
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299cf"
  },
  "name": "Air Fryer Tofu Bites",
  "title": "Tofu Bites: Snack Smart with This Crispy High-Protein Treat",
  "category": "snacks",
  "date": "2026-01-28",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763730/photo-1767426005650-cfa223180f5a_kym0xj.jpg",
  "blog_likes": [],
  "quick_summary": "Extra-crispy, oil-free tofu cubes seasoned with smoky paprika and savory nutritional yeast for a cheesy flavor. These bites are an excellent source of B-Vitamins and provide a high-protein alternative to traditional processed snacks. They are perfect for snacking on the go or adding a satisfying crunch to your favorite salad or grain bowl.",
  "description": "The air fryer allows us to achieve a deep-fried crunch using virtually no oil, making these tofu bites a healthy snack or salad topper. We press the tofu to remove excess moisture, toss it in a dry rub of paprika, garlic powder, and nutritional yeast, and air fry until golden. They are high in plant protein and incredibly versatile.",
  "health_benefits": [
    "B-Vitamins",
    "Heart healthy",
    "High protein snack"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c5"
  },
  "name": "Honey Garlic Shrimp",
  "title": "Honey Garlic Shrimp: Boost Immunity with This Quick Protein Dish",
  "category": "dinner",
  "date": "2026-01-14",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763496/photo-1766589140087-173546c80344_naqeza.jpg",
  "blog_likes": [],
  "quick_summary": "Succulent, quick-seared shrimp glazed in a natural sauce of golden honey and freshly minced garlic cloves. This dish provides a significant boost of zinc to support your immune system while remaining very low in saturated fats. It is the perfect solution for a high-protein dinner when you are short on time but want quality nutrition.",
  "description": "This dish balances sweetness and pungency perfectly, using wild-caught shrimp as the lean protein base. The glaze is reduced in a hot wok until it becomes sticky and coats each shrimp evenly. It is garnished with toasted sesame seeds and sliced scallions, making it a restaurant-quality meal that can be prepared in under fifteen minutes.",
  "health_benefits": [
    "Zinc for immunity",
    "Low fat",
    "Fast prep"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c6"
  },
  "name": "Red Lentil Detox Soup",
  "title": "Red Lentils: Cleanse and Nourish with This Gentle Detox Soup",
  "category": "dinner",
  "date": "2026-01-28",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763462/photo-1586445211323-690cc5f112c3_al2a9s.jpg",
  "blog_likes": [],
  "quick_summary": "A cleansing and velvety soup blended with red lentils, sweet carrots, and a warming touch of fresh ginger root. Designed to support liver detoxification, this soup is incredibly easy on the digestive system while remaining rich in folate. It is a gentle yet nutrient-dense way to end your day on a healthy and balanced note.",
  "description": "Crafted for those looking to reset their system, this soup is free from heavy oils and dairy. The lentils provide a thick, satisfying consistency, while the ginger adds a mild heat that aids digestion. It is lightly seasoned with sea salt and black pepper to allow the natural, clean flavors of the vegetables to shine through.",
  "health_benefits": [
    "Liver detox support",
    "High folate",
    "Easy digestion"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299cb"
  },
  "name": "Moringa Green Smoothie",
  "title": "Moringa: Boost Health with This Nutrient-Dense Superfood",
  "category": "breakfast",
  "date": "2025-12-11",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763323/photo-1660554042516-887b45e62cb3_quzvgz.jpg",
  "blog_likes": [],
  "quick_summary": "A nutrient-dense green smoothie featuring organic moringa powder, ripe banana, and refreshing coconut water. This drink acts as a powerful natural multi-vitamin, providing a clean energy surge without any caffeine crash. It is the ultimate anti-aging elixir to fuel your body with essential vitamins and minerals first thing in the morning.",
  "description": "Moringa is known as the 'miracle tree' for its incredible nutrient profile, and this smoothie is the easiest way to enjoy its benefits. We blend the slightly peppery moringa powder with a frozen banana for creaminess and coconut water for electrolyte-rich hydration. It is a quick, drinkable breakfast that doesn't compromise on nutrition.",
  "health_benefits": [
    "Multi-vitamin source",
    "Natural energy",
    "Anti-aging"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299cd"
  },
  "name": "Amla & Honey Shot",
  "title": "Amla: Power Up Immunity with This Vitamin-C Rich Morning Shot",
  "category": "breakfast",
  "date": "2025-12-10",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763259/photo-1765461107775-64b964a176c0_fmagcm.jpg",
  "blog_likes": [],
  "quick_summary": "A potent morning wellness shot made from fresh Indian gooseberry juice and a touch of raw organic honey. Known for having one of the highest concentrations of Vitamin C, this shot acts as a powerful blood purifier and hair health booster. It is a quick and sharp way to invigorate your metabolism and immune system for the day ahead.",
  "description": "Amla is a staple in Ayurvedic medicine, prized for its immense antioxidant capacity. This shot is prepared by cold-pressing fresh gooseberries and mixing the juice with raw honey to balance the fruit's natural astringency. It is meant to be taken on an empty stomach to maximize nutrient absorption and kickstart the digestive fire.",
  "health_benefits": [
    "Highest Vitamin C",
    "Hair health",
    "Blood purifier"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299be"
  },
  "name": "Quinoa Avocado Salad",
  "title": "Quinoa & Avocado: Fuel Your Day with This Fresh Power Salad",
  "category": "breakfast",
  "date": {
    "$date": "2026-01-06T00:00:00.000Z"
  },
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762749/photo-1765891542661-7dee84250860_w7qcoe.jpg",
  "blog_likes": [],
  "quick_summary": "Fresh quinoa tossed with ripe avocado, cherry tomatoes, and a zesty lime-cilantro dressing. This vibrant salad provides a perfect balance of complex carbohydrates and healthy fats to keep your energy stable throughout the afternoon. It is a refreshing lunch option that packs a punch of vital micronutrients in every single bite.",
  "description": "A bright and zesty Mediterranean-inspired salad that focuses on texture and freshness. Fluffy quinoa serves as the base, providing all nine essential amino acids, while creamy avocado adds a satisfying richness. The dressing is made from freshly squeezed lime juice and high-quality extra virgin olive oil, ensuring every forkful is bright and heart-healthy.",
  "health_benefits": [
    "Rich in healthy fats",
    "Complete protein source",
    "High Protin",
    "testy",
    "Test by Kevin"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c3"
  },
  "name": "Greek Chicken Power Bowl",
  "title": "Greek Chicken Bowl: Build Strength with This Protein-Packed Meal",
  "category": "lunch",
  "date": "2026-01-31",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762973/photo-1766677525315-c5c4aac5ce1e_irl7uw.jpg",
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "quick_summary": "Marinated grilled chicken served alongside crisp cucumber, briny olives, tangy feta, and a dollop of fresh tzatziki. This power bowl is a protein-heavy masterpiece designed to support muscle recovery and long-term metabolic health. It brings the bright, fresh flavors of the Mediterranean straight to your lunch table every day.",
  "description": "This bowl is built for performance and flavor, featuring chicken breast marinated in lemon, oregano, and garlic. The base of the bowl can be customized with leafy greens or farro, then topped with a colorful array of Mediterranean staples. The house-made tzatziki is crafted from strained yogurt and grated cucumber, offering a cool, probiotic finish.",
  "health_benefits": [
    "Probiotic support",
    "Muscle recovery",
    "Metabolism boost"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "69691b7025dbb5094e2f3d33"
  },
  "name": "Spicy Lentil & Sweet Potato Curry",
  "title": "Hearty Lentils: Comfort in a Bowl",
  "category": "vegan",
  "date": "2026-01-13",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1766745559/samples/breakfast.jpg",
  "quick_summary": "A warming, protein-rich curry made with red lentils and tender sweet potatoes, simmered in a spiced tomato-coconut sauce. This plant-based dish is perfect for chilly evenings, offering comfort, flavor, and nourishing nutrients in every spoonful.",
  "health_benefits": [
    "Supports digestive health",
    "High in plant protein",
    "Rich in vitamins and minerals"
  ],
  "blog_likes": [],
  "description": "This curry combines the earthy sweetness of roasted sweet potatoes with the hearty texture of red lentils. Aromatics like onion, garlic, and ginger are sautéed before adding a fragrant blend of spices including cumin, coriander, and smoked paprika. Coconut milk gives the curry a creamy finish, while fresh cilantro adds a burst of color and freshness.",
  "__v": 0,
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c7"
  },
  "name": "Chia Seed ",
  "title": "Chia Seeds: Support Heart Health with This Omega-Rich Pudding",
  "category": "breakfast",
  "date": "2026-01-03",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763447/photo-1701960980837-f8a10c704789_plnise.jpg",
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "quick_summary": "Nutritious overnight chia seeds soaked in silky almond milk and topped with crunchy sliced almonds and fresh kiwi. This breakfast is a powerhouse of Omega-3 fatty acids, promoting heart health and long-lasting hydration for the body. It is a convenient, make-ahead meal that keeps you feeling full and focused all through the morning.",
  "description": "A simple yet effective breakfast that utilizes the gelling properties of chia seeds to create a pudding-like texture without cooking. We use unsweetened almond milk and a drop of vanilla bean paste for flavor. The toppings provide a mix of textures—the crunch of the almonds and the soft tartness of the kiwi—making it a delightful morning treat.",
  "health_benefits": [
    "High Omega-3s",
    "Hydration support",
    "Supports gut health"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c0"
  },
  "name": "Spinach Sweet Potato Dhal",
  "title": "Spinach & Lentils: Boost Iron Naturally with This Comforting Dhal",
  "category": "lunch",
  "date": "2026-01-08",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762706/photo-1767246466534-6c6852acd2b5_ljilb9.jpg",
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "quick_summary": "A comforting red lentil dhal packed with roasted sweet potatoes and handfuls of fresh baby spinach. The earthy spices and creamy texture provide a soothing meal that is naturally high in iron and essential minerals. This bowl of goodness is excellent for maintaining steady energy levels throughout a busy and demanding day.",
  "description": "This dhal is a nutritional powerhouse designed to provide lasting satiety. Red lentils are cooked until soft and creamy, blended with caramelized cubes of roasted sweet potato that add a subtle sweetness. Infused with cumin, coriander, and mustard seeds, this dish is finished with a big handful of spinach to maximize your iron intake naturally.",
  "health_benefits": [
    "Rich in Vitamin A",
    "High iron content",
    "Complex carbohydrates"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c8"
  },
  "name": "Tofu Lettuce Cups",
  "title": "Tofu Lettuce Cups: Enjoy Plant Protein in This Light Crunchy Snack",
  "category": "snacks",
  "date": "2025-12-25",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763430/photo-1705088293125-063256c88cf5_sdmezg.jpg",
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "quick_summary": "Crumbled tofu sautéed with crunchy water chestnuts and aromatic spices, served in crisp, cool romaine lettuce leaves. These cups are ultra-low in carbohydrates and rich in plant isoflavones for improved skin health and vitality. They offer a delightful crunch and a clean, light snacking experience for any time you need a quick boost.",
  "description": "These lettuce cups are a healthy take on a classic appetizer, using firm tofu that has been crumbled and browned to mimic ground meat. The filling is seasoned with hoisin sauce, ginger, and lime, providing a complex flavor profile that is both salty and sweet. Served in chilled romaine leaves, they are a refreshing and high-protein snack option.",
  "health_benefits": [
    "Plant isoflavones",
    "Ultra low carb",
    "Skin health"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299c2"
  },
  "name": "Mushroom Cauliflower Rice",
  "title": "Mushrooms & Cauliflower: Stay Light with This Low-Carb Power Stir-Fry",
  "category": "lunch",
  "date": "2026-01-22",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767762916/photo-1767476439256-0c2cd219fef5_wboszu.jpg",
  "blog_likes": [],
  "quick_summary": "Low-carb cauliflower rice stir-fried with savory wild mushrooms, garlic, and soy-free aminos for a deep umami flavor. This dish is an ideal choice for anyone looking to manage their weight without sacrificing flavor or portion size. It is light, nutritious, and incredibly quick to prepare for a healthy and satisfying weekday lunch.",
  "description": "A keto-friendly alternative to traditional fried rice, this stir-fry uses finely grated cauliflower as a nutrient-dense base. We use a variety of mushrooms, including shiitake and cremini, to provide a meaty texture and a dose of Vitamin D. It is seasoned with coconut aminos and ginger for a clean, savory finish that won't leave you feeling bloated.",
  "health_benefits": [
    "Weight management",
    "Vitamin D source",
    "Low calorie"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299cc"
  },
  "name": "Sesame Roasted Broccoli",
  "title": "Broccoli & Sesame: Balance Hormones with This Nutty Roasted Veg",
  "category": "snacks",
  "date": "2026-01-01",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763279/photo-1765372036765-a4f1038feea2_ecd1xo.jpg",
  "blog_likes": [],
  "quick_summary": "Crispy charred broccoli florets tossed in toasted sesame oil and sprinkled with crunchy sesame seeds for extra flavor. This snack is exceptionally rich in sulforaphane, which helps the body balance hormones and maintain healthy bone density. It is a delicious, nutty way to increase your daily intake of green cruciferous vegetables easily.",
  "description": "Roasting broccoli at a high temperature transforms it from a simple vegetable into a savory, addictive snack. The florets become crisp and caramelized, absorbing the deep flavor of the toasted sesame oil. A sprinkle of sea salt and a dash of red pepper flakes provide a perfect balance of savory and spicy notes.",
  "health_benefits": [
    "Hormonal balance",
    "Bone density",
    "Sulforaphane rich"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299ca"
  },
  "name": "Black Bean Quesadillas",
  "title": "Black Beans: Stay Full Longer with These Fiber-Rich Quesadillas",
  "category": "snacks",
  "date": "2025-12-10",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763341/photo-1631255444914-69f8b115b096_rpxgfa.jpg",
  "blog_likes": [],
  "quick_summary": "Whole-wheat tortillas filled with perfectly seasoned black beans and a light sprinkle of reduced-fat cheese. These quesadillas provide a high-fiber snack that helps maintain a low glycemic index and keeps you feeling full for longer. They are a smart, protein-packed choice for a quick snack or a light handheld meal during busy days.",
  "description": "These quesadillas focus on nutrient density by using whole-wheat tortillas and fiber-rich black beans seasoned with cumin and chili powder. We use a modest amount of sharp cheddar to provide flavor without excessive calories. They are toasted on a dry skillet until the outside is golden and the inside is warm and melty.",
  "health_benefits": [
    "Sustained fullness",
    "High protein",
    "Low glycemic index"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "695d004af0a0ffcef2c299d0"
  },
  "name": "Roasted Beetroot Salad",
  "title": "Beetroot: Support Heart Health with This Ruby Power Salad",
  "category": "lunch",
  "date": "2025-12-10",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1767763788/photo-1767428214555-850a5f935b4c_kwjh3y.jpg",
  "blog_likes": [],
  "quick_summary": "Earthy roasted beets served over a bed of peppery arugula, topped with toasted walnuts and a light balsamic glaze. This salad is naturally rich in nitrates, which help support healthy blood pressure and enhance overall athletic performance. It is a visually stunning and nutrient-dense lunch that fuels both your body and your mind.",
  "description": "Beetroot is a functional food that thrives when roasted, as the heat concentrates its natural sugars and earthy flavor. This salad pairs the sweetness of the beets with the sharp bite of arugula and the creamy crunch of walnuts. A simple drizzle of balsamic vinegar and honey ties all the components together for a balanced and elegant lunch.",
  "health_benefits": [
    "Blood pressure support",
    "Nitrate rich",
    "Athletic performance"
  ],
  "bookmark": []
},
{
  "_id": {
    "$oid": "6970ac827c0e4148535e2172"
  },
  "name": "Blog testing by kevin",
  "title": "Blog testing by kevin",
  "category": "vegan",
  "date": "2026-01-22",
  "image": "https://res.cloudinary.com/blogsandrecipes/image/upload/v1758351529/Fish-Tacos-1337495_hygojc.jpg",
  "quick_summary": "Blog testing by kevin",
  "health_benefits": [],
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "description": "Blog testing by kevin",
  "bookmark": [],
  "__v": 0
},
{
  "_id": {
    "$oid": "6971ba34dde8a3c84ead6fde"
  },
  "name": "Testing by kevin 3",
  "title": "Testing by kevin 3",
  "category": "lunch",
  "image": "https://res.cloudinary.com/blogsandrecipes/image/upload/v1758351529/Fish-Tacos-1337495_hygojc.jpg",
  "quick_summary": "Testing by kevin 3",
  "health_benefits": [],
  "blog_likes": [],
  "description": "Testing by kevin 3",
  "bookmark": [],
  "date": {
    "$date": "2026-01-22T05:48:36.774Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "697316164aee72be7dd2ed95"
  },
  "name": "Basil Seeds Benefits",
  "title": "The Superfood You’ve Been Ignoring",
  "category": "vegetarian",
  "image": "https://res.cloudinary.com/dbl3arvr1/image/upload/v1769149974/bsiczomugecdxnkui1gq.jpg",
  "quick_summary": "Bored of eating the same things every day? Try basil seeds! These tiny seeds have been used in cooking for a long time and are now becoming popular worldwide. They not only make your food tastier but also have many health benefits. Basil seeds are good for your digestion and also great for staying hydrated, especially in hot weather. Plus, they're full of important minerals and antioxidants that keep you healthy. You can use basil seeds in lots of ways. Add them to lemonade for a refreshing twist, make a healthy pudding with them or mix them into salad dressings for extra flavour. They're also perfect for energy balls, giving you a quick boost when you need it. So, why not give basil seeds a try?",
  "health_benefits": [
    "Digestive Health",
    "Weight Management",
    "Hydration Support",
    "Nutrient-rich"
  ],
  "blog_likes": [
    "6968a51539978105ccf063a1"
  ],
  "description": "Do you want to try something new and exciting while getting some amazing health benefits at the same time? Then basil seeds are your new best friends. These tiny seeds have been a staple in Indian and Southeast Asian cuisine for centuries but have recently gained popularity worldwide. Not only are they versatile in terms of everyday cooking applications, but they also offer an impressive array of health benefits",
  "bookmark": [],
  "date": {
    "$date": "2026-01-23T06:32:54.778Z"
  },
  "__v": 0
}]